pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
/***************************************************************************//**
* \file cy_smif_memslot.c
* \version 1.0
*
* \brief
*  This file provides the source code for the memory-level APIs of the SMIF driver.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_smif_memslot.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*     Function Prototypes
***************************************/
static void Cy_SMIF_Memslot_XipRegInit(SMIF_DEVICE_Type volatile *dev,
                            cy_stc_smif_mem_config_t const * memCfg);


/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_Init
****************************************************************************//**
*
* This function initializes the slots of the memory device in the SMIF
* configuration. After this initialization, the memory slave devices are
* automatically mapped into the PSoC memory map. The function needs the SMIF
* to be running in the memory mode to have the memory mapped into the PSoC
* address space. This function is typically called in the System initialization
* phase to initialize all the memory-mapped SMIF devices.
* This function only configures the memory device portion of the SMIF
* initialization and therefore assumes that the SMIF blocks initialization is
* achieved using Cy_SMIF_Init(). The cy_stc_smif_context_t context structure
* returned from Cy_SMIF_Init() is passed as a parameter to this function.
* This function calls the \ref Cy_SMIF_Memslot_SfdpDetect() function for each
* element of the \ref cy_stc_smif_mem_config_t memConfig array and fills the memory
* parameters if the autoDetectSfdp field is enabled in \ref cy_stc_smif_mem_config_t.
* The filled memConfig is a part of the \ref cy_stc_smif_block_config_t * blockConfig
* structure. The function expects that all the requirements of
*  \ref Cy_SMIF_Memslot_SfdpDetect() is provided.
*
* \param base
* The address of the slave-slot device register to initialize.
*
* \param context
* The SMIF internal context structure of the block.
*
* \param blockConfig
* The configuration structure array that configures the SMIF memory device to be
* mapped into the PSoC memory map. \ref cy_stc_smif_mem_config_t
*
* \return The memory slot initialization status.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_Init(SMIF_Type *base,
                            cy_stc_smif_block_config_t * const blockConfig,
                            cy_stc_smif_context_t *context)
{
    SMIF_DEVICE_Type volatile * device;
    cy_stc_smif_mem_config_t const * memCfg;
    uint32_t result = (uint32_t)CY_SMIF_BAD_PARAM;
    uint32_t sfdpRes =(uint32_t)CY_SMIF_SUCCESS;
    uint32_t idx;

    if (NULL != blockConfig)
    {
        uint32_t size = blockConfig->memCount;
        cy_stc_smif_mem_config_t** extMemCfg = blockConfig->memConfig;

        result = (uint32_t)CY_SMIF_SUCCESS;
        for(idx = 0UL; idx < size; idx++)
        {
            memCfg = extMemCfg[idx];
            if (NULL != memCfg)
            {
                device = Cy_SMIF_GetDeviceBySlot(base, memCfg->slaveSelect);
                if (NULL != device)
                {
                    /* The slave-slot initialization of the device control register.
                     * Cy_SMIF_Memslot_SfdpDetect() must work */
                    device->CTL = _CLR_SET_FLD32U(device->CTL,
                                                SMIF_DEVICE_CTL_DATA_SEL,
                                                (uint32_t)memCfg->dataSelect);
                    uint32_t sfdpRet = (uint32_t)CY_SMIF_SUCCESS;
                    if (0U != (memCfg->flags & CY_SMIF_FLAG_DETECT_SFDP))
                    {
                        sfdpRet = (uint32_t)Cy_SMIF_Memslot_SfdpDetect(base,
                                                memCfg->deviceCfg,
                                                memCfg->slaveSelect,
                                                memCfg->dataSelect,
                                                context);
                        if((uint32_t)CY_SMIF_SUCCESS != sfdpRet)
                        {
                            sfdpRes |=  ((uint32_t)CY_SMIF_SFDP_FAIL << idx);
                        }
                    }
                    if (((uint32_t)CY_SMIF_SUCCESS == sfdpRet) &&
                            (0U != (memCfg->flags & CY_SMIF_FLAG_MEMORY_MAPPED)))
                    {
                        Cy_SMIF_Memslot_XipRegInit(device, memCfg);

                        /* The device control register initialization */
                        device->CTL = (memCfg->flags & CY_SMIF_FLAG_WR_EN) |
                                      (memCfg->flags & CY_SMIF_FLAG_CRYPTO_EN) |
                                      _VAL2FLD(SMIF_DEVICE_CTL_DATA_SEL,  (uint32_t)memCfg->dataSelect)   |
                                      SMIF_DEVICE_CTL_ENABLED_Msk;
                    }

                    /* Read the register to flush the buffer */
                    (void) device->CTL;
                }
                else
                {
                    result = (uint32_t)CY_SMIF_BAD_PARAM;
                    break;
                }
            }
        }
    }
    if((uint32_t)CY_SMIF_SUCCESS != sfdpRes)
    {
        result = CY_SMIF_ID | CY_PDL_STATUS_ERROR | sfdpRes;
    }
    return (cy_en_smif_status_t) result;
}


