pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_XipRegInit
****************************************************************************//**
*
* \internal
* This function initializes the memory device registers used for the XIP mode of
* the specified device.
*
* \param dev
* The SMIF memory device registers structure. \ref SMIF_DEVICE_Type
*
* \param memCfg
* The memory configuration structure that configures the SMIF memory device to
*  map into the PSoC memory map. \ref cy_stc_smif_mem_config_t
*
*******************************************************************************/
static void Cy_SMIF_Memslot_XipRegInit(SMIF_DEVICE_Type volatile *dev,
                            cy_stc_smif_mem_config_t const * memCfg)
{
    cy_stc_smif_mem_device_cfg_t const * devCfg = memCfg->deviceCfg;
    cy_stc_smif_mem_cmd_t const * read = devCfg->readCmd;
    cy_stc_smif_mem_cmd_t const * prog = devCfg->programCmd;

    dev->ADDR = (SMIF_DEVICE_ADDR_ADDR_Msk & memCfg->baseAddress);
    /* Convert the size in the mask*/
    dev->MASK = (SMIF_DEVICE_MASK_MASK_Msk & (~(memCfg->memMappedSize) + 1UL));

    dev->ADDR_CTL = _VAL2FLD(SMIF_DEVICE_ADDR_CTL_SIZE2, (devCfg->numOfAddrBytes - 1UL)) |
                   ((0UL != memCfg->dualQuadSlots)? SMIF_DEVICE_ADDR_CTL_DIV2_Msk: 0UL);

    dev->RD_CMD_CTL = (CY_SMIF_NO_COMMAND_OR_MODE != read->command)?
                        (_VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_CODE,  (uint32_t)read->command)  |
                         _VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_WIDTH, (uint32_t)read->cmdWidth) |
                         SMIF_DEVICE_RD_CMD_CTL_PRESENT_Msk)
                        : 0U;

    dev->RD_ADDR_CTL = _VAL2FLD(SMIF_DEVICE_RD_ADDR_CTL_WIDTH, (uint32_t)read->addrWidth);

    dev->RD_MODE_CTL = (CY_SMIF_NO_COMMAND_OR_MODE != read->mode)?
                        (_VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_CODE,  (uint32_t)read->mode)     |
                         _VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_WIDTH, (uint32_t)read->modeWidth)|
                         SMIF_DEVICE_RD_CMD_CTL_PRESENT_Msk)
                        : 0U;

    dev->RD_DUMMY_CTL = (0UL != read->dummyCycles)?
                        (_VAL2FLD(SMIF_DEVICE_RD_DUMMY_CTL_SIZE5, (read->dummyCycles - 1UL)) |
                         SMIF_DEVICE_RD_DUMMY_CTL_PRESENT_Msk)
                        : 0U;

    dev->RD_DATA_CTL = _VAL2FLD(SMIF_DEVICE_RD_DATA_CTL_WIDTH, (uint32_t)read->dataWidth);

    dev->WR_CMD_CTL = (CY_SMIF_NO_COMMAND_OR_MODE != prog->command)?
                        (_VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_CODE,  (uint32_t)prog->command) |
                         _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_WIDTH, (uint32_t)prog->cmdWidth)|
                         SMIF_DEVICE_WR_CMD_CTL_PRESENT_Msk)
                        : 0U;

    dev->WR_ADDR_CTL = _VAL2FLD(SMIF_DEVICE_WR_ADDR_CTL_WIDTH, (uint32_t)prog->addrWidth);

    dev->WR_MODE_CTL = (CY_SMIF_NO_COMMAND_OR_MODE != prog->mode)?
                      (_VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_CODE,  (uint32_t)prog->mode)     |
                       _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_WIDTH, (uint32_t)prog->modeWidth)|
                       SMIF_DEVICE_WR_CMD_CTL_PRESENT_Msk)
                       : 0UL;

    dev->WR_DUMMY_CTL = (0UL != prog->dummyCycles)?
                        (_VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_SIZE5, (prog->dummyCycles - 1UL)) |
                         SMIF_DEVICE_WR_DUMMY_CTL_PRESENT_Msk)
                        : 0U;

    dev->WR_DATA_CTL = _VAL2FLD(SMIF_DEVICE_WR_DATA_CTL_WIDTH, (uint32_t)prog->dataWidth);
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemoryDeInit
****************************************************************************//**
*
* This function de-initializes all slave slots of the memory device to their default
* values.
*
* \param base
* Holds the base address of the SMIF block registers.
*
*******************************************************************************/
void Cy_SMIF_Memslot_DeInit(SMIF_Type *base)
{
    /* Configure the SMIF device slots to the default values. The default value is 0 */
    uint32_t deviceIndex;

    for(deviceIndex = 0UL; deviceIndex < (uint32_t)SMIF_DEVICE_NR; deviceIndex++)
    {
        base->DEVICE[deviceIndex].CTL           = 0U;
        base->DEVICE[deviceIndex].ADDR          = 0U;
        base->DEVICE[deviceIndex].MASK          = 0U;
        base->DEVICE[deviceIndex].ADDR_CTL      = 0U;
        base->DEVICE[deviceIndex].RD_CMD_CTL    = 0U;
        base->DEVICE[deviceIndex].RD_ADDR_CTL   = 0U;
        base->DEVICE[deviceIndex].RD_MODE_CTL   = 0U;
        base->DEVICE[deviceIndex].RD_DUMMY_CTL  = 0U;
        base->DEVICE[deviceIndex].RD_DATA_CTL   = 0U;
        base->DEVICE[deviceIndex].WR_CMD_CTL    = 0U;
        base->DEVICE[deviceIndex].WR_ADDR_CTL   = 0U;
        base->DEVICE[deviceIndex].WR_MODE_CTL   = 0U;
        base->DEVICE[deviceIndex].WR_DUMMY_CTL  = 0U;
        base->DEVICE[deviceIndex].WR_DATA_CTL   = 0U;

        /* Read the register to flush the buffer */
        (void) base->DEVICE[deviceIndex].CTL;
    }
}


/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_CmdWriteEnable
****************************************************************************//**
*
* This function sends the Write Enable command to the memory device.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* The Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode,
* this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* The internal SMIF context data. \ref cy_stc_smif_context_t
*
* \param memDevice
* The device to which the command is sent.
*
* \return A status of the command transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Type *base,
                                        cy_stc_smif_mem_config_t const *memDevice,
                                        cy_stc_smif_context_t const *context)
{
    /* The memory Write Enable */
    cy_stc_smif_mem_cmd_t* writeEn = memDevice->deviceCfg->writeEnCmd;

    return Cy_SMIF_TransmitCommand( base, (uint8_t) writeEn->command,
                                    writeEn->cmdWidth,
                                    CY_SMIF_CMD_WITHOUT_PARAM,
                                    CY_SMIF_CMD_WITHOUT_PARAM,
                                    (cy_en_smif_txfr_width_t)CY_SMIF_CMD_WITHOUT_PARAM,
                                    memDevice->slaveSelect,
                                    CY_SMIF_TX_LAST_BYTE,
                                    context);
}


