pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_CmdWriteDisable
****************************************************************************//**
*
* This function sends a Write Disable command to the memory device.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode
* this API should be called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* The internal SMIF context data. \ref cy_stc_smif_context_t
*
* \param memDevice
* The device to which the command is sent.
*
* \return A status of the command transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_CmdWriteDisable(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    cy_stc_smif_context_t const *context)
{
    cy_stc_smif_mem_cmd_t* writeDis = memDevice->deviceCfg->writeDisCmd;

    /* The memory write disable */
    return Cy_SMIF_TransmitCommand( base, (uint8_t)writeDis->command,
                                writeDis->cmdWidth,
                                CY_SMIF_CMD_WITHOUT_PARAM,
                                CY_SMIF_CMD_WITHOUT_PARAM,
                                (cy_en_smif_txfr_width_t) CY_SMIF_CMD_WITHOUT_PARAM,
                                memDevice->slaveSelect,
                                CY_SMIF_TX_LAST_BYTE,
                                context);
}


/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_IsBusy
****************************************************************************//**
*
* This function checks if the status of the memory device is busy.
* This is done by reading the status register and the corresponding bit
* (stsRegBusyMask). This function is a blocking function until the status
* register from the memory is read.
*
* \note In the dual quad mode, this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* The internal SMIF context data.
*
* \param memDevice
*  The device to which the command is sent.
*
* \return A status of the memory device.
*       - True - The device is busy or a timeout occurs.
*       - False - The device is not busy.
*
*******************************************************************************/
bool Cy_SMIF_Memslot_IsBusy(SMIF_Type *base, cy_stc_smif_mem_config_t *memDevice,
                            cy_stc_smif_context_t const *context)
{
    uint8_t  status = 1U;
    cy_en_smif_status_t readStsResult;
    cy_stc_smif_mem_device_cfg_t* device =  memDevice->deviceCfg;

    readStsResult = Cy_SMIF_Memslot_CmdReadSts(base, memDevice, &status,
                         (uint8_t)device->readStsRegWipCmd->command,
                         context);

    if (CY_SMIF_SUCCESS == readStsResult)
    {
        /* Masked not busy bits in returned status */
        status &= (uint8_t)device->stsRegBusyMask;
    }

    return (0U != status);
}


/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_QuadEnable
****************************************************************************//**
*
* This function enables the memory device for the quad mode of operation.
* This command must be executed before sending Quad SPI commands to the
* memory device.
*
* \note In the dual quad mode, this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* The internal SMIF context data.
*
* \param memDevice
* The device to which the command is sent.
*
* \return A status of the command.
*   - \ref CY_SMIF_SUCCESS
*   - \ref CY_SMIF_NO_QE_BIT
*   - \ref CY_SMIF_CMD_FIFO_FULL
*   - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_QuadEnable(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t *memDevice,
                                    cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result;
    uint8_t statusReg[CY_SMIF_QE_BIT_STS_REG2_T1] = {0U};

    cy_stc_smif_mem_device_cfg_t* device =  memDevice->deviceCfg;
    uint8_t readQeCmd  = (uint8_t)device->readStsRegQeCmd->command;
    uint8_t writeQeCmd = (uint8_t)device->writeStsRegQeCmd->command;
    uint8_t readWipCmd = (uint8_t)device->readStsRegWipCmd->command;

    result = Cy_SMIF_Memslot_CmdReadSts(base, memDevice, &statusReg[0U],
                readQeCmd, context);

    if (CY_SMIF_SUCCESS == result)
    {
        uint32_t qeMask = device->stsRegQuadEnableMask;

        switch(qeMask)
        {
            case CY_SMIF_SFDP_QE_BIT_6_OF_SR_1:
                statusReg[0U] |= (uint8_t)qeMask;
                result = Cy_SMIF_Memslot_CmdWriteSts(base, memDevice,
                            &statusReg[0U], writeQeCmd, context);
                break;
            case CY_SMIF_SFDP_QE_BIT_1_OF_SR_2:
                /* Read status register 1 with the assumption that WIP is always in
                 * status register 1 */
                result = Cy_SMIF_Memslot_CmdReadSts(base, memDevice,
                            &statusReg[0U], readWipCmd, context);
                if (CY_SMIF_SUCCESS == result)
                {
                    result = Cy_SMIF_Memslot_CmdReadSts(base, memDevice,
                                &statusReg[1U], readQeCmd, context);
                    if (CY_SMIF_SUCCESS == result)
                    {
                        statusReg[1U] |= (uint8_t)qeMask;
                        result = Cy_SMIF_Memslot_CmdWriteSts(base, memDevice,
                                    statusReg, writeQeCmd, context);
                    }
                }
                break;
            case CY_SMIF_SFDP_QE_BIT_7_OF_SR_2:
                result = Cy_SMIF_Memslot_CmdReadSts(base, memDevice,
                            &statusReg[1U], readQeCmd, context);
                if (CY_SMIF_SUCCESS == result)
                {
                    statusReg[1U] |= (uint8_t)qeMask;
                    result = Cy_SMIF_Memslot_CmdWriteSts(base, memDevice,
                                &statusReg[1U], writeQeCmd, context);
                }
                break;
            default:
                result = CY_SMIF_NO_QE_BIT;
                break;
        }

