pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_Memslot_SfdpDetect
****************************************************************************//**
*
* This function detects the device signature for SFDP devices.
* Refer to the SFDP spec (JESD216B) for details.
* The function asks the device using an SPI and then populates the relevant
* parameters for \ref cy_stc_smif_mem_device_cfg_t.
*
* \note This function is a blocking function and blocks until the structure data
* is read and returned. This function uses \ref Cy_SMIF_TransmitCommand()
* If there is no support for SFDP in the memory device, the API returns an
* error condition. The function requires:
*   - SMIF initialized and enabled to work in the normal mode;
*   - readSfdpCmd field of \ref cy_stc_smif_mem_device_cfg_t is enabled.
*
* \note The SFDP detect takes into account the types of the SPI supported by the
* memory device and also the dataSelect option selected to choose which SPI mode
* (SPI, DSPI, QSPI) to load into the structures. The algorithm prefers
* QSPI>DSPI>SPI, provided there is support for it in the memory device and the
* dataSelect selected by the user.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* The internal SMIF context data.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param dataSelect
* The data line selection options for a slave device.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_NO_SFDP_SUPPORT
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Memslot_SfdpDetect(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    cy_en_smif_data_select_t dataSelect,
                                    cy_stc_smif_context_t *context)
{
    uint8_t sfdpBuffer[CY_SMIF_SFDP_LENGTH];
    uint8_t sfdpAddress[CY_SMIF_SFDP_ADDRESS_LENGTH] = {0x00U, 0x00U, 0x00U};
    cy_en_smif_status_t result;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;

    /* Slave slot initialization */
    Cy_SMIF_SetDataSelect(base, slaveSelect, dataSelect);

    result = Cy_SMIF_TransmitCommand( base, (uint8_t)cmdSfdp->command,
                cmdSfdp->cmdWidth, sfdpAddress, CY_SMIF_SFDP_ADDRESS_LENGTH,
                cmdSfdp->addrWidth, slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE,
                context);
    if(CY_SMIF_SUCCESS == result)
    {
        result = Cy_SMIF_SendDummyCycles(base, cmdSfdp->dummyCycles);
    }

    if(CY_SMIF_SUCCESS == result)
    {
        result = Cy_SMIF_ReceiveData( base, sfdpBuffer, CY_SMIF_SFDP_LENGTH,
                    cmdSfdp->dataWidth, NULL, context);
    }

    if (CY_SMIF_SUCCESS == result)
    {
        uint32_t cmdTimeout = context->timeout;
        while (((uint32_t) CY_SMIF_REC_CMPLT != context->transferStatus) &&
                (CY_SMIF_EXCEED_TIMEOUT != result))
        {
            /* Wait until the Read of the SFDP operation is completed. */
            result = Cy_SMIF_TimeoutRun(&cmdTimeout);
        }
    }

    if (CY_SMIF_SUCCESS == result)
    {
        if((sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_00] == (uint8_t)'S') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_01] == (uint8_t)'F') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_02] == (uint8_t)'D') &&
         (sfdpBuffer[CY_SMIF_SFDP_SING_BYTE_03] == (uint8_t)'P') &&
         (sfdpBuffer[CY_SMIF_SFDP_MINOR_REV] >= CY_SMIF_SFDP_JEDEC_REV_B) &&
         (sfdpBuffer[CY_SMIF_SFDP_MAJOR_REV] == CY_SMIF_SFDP_MAJOR_REV_1))
        {
            /* The address of the JEDEC basic flash parameter table */
            uint8_t offset = sfdpBuffer[CY_SMIF_SFDP_PARAM_TABLE_PTR];
            cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;

            /* The number of address bytes used by the memory slave device */
            uint32_t sfdpDataIndex = CY_SMIF_SFDP_BFPT_BYTE_02 + (uint32_t)offset;
            uint32_t sfdpAddrCode = _FLD2VAL(CY_SMIF_SFDP_ADDRESS_BYTES,
                                                (uint32_t)sfdpBuffer
                                                [sfdpDataIndex]);
            switch(sfdpAddrCode)
            {
                case CY_SMIF_SFDP_THREE_BYTES_ADDR_CODE:
                    device->numOfAddrBytes = CY_SMIF_THREE_BYTES_ADDR;
                    break;
                case CY_SMIF_SFDP_THREE_OR_FOUR_BYTES_ADDR_CODE:
                    device->numOfAddrBytes = CY_SMIF_THREE_BYTES_ADDR;
                    break;
                case CY_SMIF_SFDP_FOUR_BYTES_ADDR_CODE:
                    device->numOfAddrBytes = CY_SMIF_FOUR_BYTES_ADDR;
                    break;
                default:
                    break;
            }

            /* Erase Time Type 1*/
            uint32_t readEraseTime   = ((uint32_t*)sfdpBuffer)[(offset/CY_SMIF_BYTES_IN_WORD) +
                                                               CY_SMIF_JEDEC_BFPT_10TH_DWORD];
            uint32_t eraseUnits = _FLD2VAL(CY_SMIF_SFDP_ERASE_T1_UNITS, readEraseTime);
            uint32_t eraseCount  = _FLD2VAL(CY_SMIF_SFDP_ERASE_T1_COUNT, readEraseTime);
            uint32_t eraseMul = _FLD2VAL(CY_SMIF_SFDP_ERASE_MUL_COUNT, readEraseTime);
            uint32_t eraseMs = 0U;

            switch (eraseUnits)
            {
                case CY_SMIF_SFDP_UNIT_0:
                    eraseMs = CY_SMIF_SFDP_ERASE_TIME_1MS;
                    break;
                case CY_SMIF_SFDP_UNIT_1:
                    eraseMs = CY_SMIF_SFDP_ERASE_TIME_16MS;
                    break;
                case CY_SMIF_SFDP_UNIT_2:
                    eraseMs = CY_SMIF_SFDP_ERASE_TIME_128MS;
                    break;
                case CY_SMIF_SFDP_UNIT_3:
                    eraseMs = CY_SMIF_SFDP_ERASE_TIME_1S;
                    break;
                default:
                    /* An unsupported SFDP value */
                    break;
            }
            /* Convert typical time to max time */
            device->eraseTime = ((eraseCount + 1U) * eraseMs) * (2U * (eraseMul + 1U));


            /* Chip Erase Time*/
            uint32_t chipEraseProgTime   = ((uint32_t*)sfdpBuffer)[(offset/CY_SMIF_BYTES_IN_WORD) +
                                                                   CY_SMIF_JEDEC_BFPT_11TH_DWORD];
            uint32_t chipEraseUnits = _FLD2VAL(CY_SMIF_SFDP_CHIP_ERASE_UNITS, chipEraseProgTime);
            uint32_t chipEraseCount = _FLD2VAL(CY_SMIF_SFDP_CHIP_ERASE_COUNT, chipEraseProgTime);
            uint32_t chipEraseMs = 0U;

