pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
            switch (chipEraseUnits)
            {
                case CY_SMIF_SFDP_UNIT_0:
                    chipEraseMs = CY_SMIF_SFDP_CHIP_ERASE_TIME_16MS;
                    break;
                case CY_SMIF_SFDP_UNIT_1:
                    chipEraseMs = CY_SMIF_SFDP_CHIP_ERASE_TIME_256MS;
                    break;
                case CY_SMIF_SFDP_UNIT_2:
                    chipEraseMs = CY_SMIF_SFDP_CHIP_ERASE_TIME_4S;
                    break;
                case CY_SMIF_SFDP_UNIT_3:
                    chipEraseMs = CY_SMIF_SFDP_CHIP_ERASE_TIME_64S;
                    break;
                default:
                    /* An unsupported SFDP value*/
                    break;
            }
            /* Convert typical time to max time */
            device->chipEraseTime = ((chipEraseCount + 1U)*chipEraseMs) * (2U *(eraseMul + 1U));

            /* Page Program Time*/
            uint32_t programTimeUnits = _FLD2VAL(CY_SMIF_SFDP_PAGE_PROG_UNITS, chipEraseProgTime);
            uint32_t programTimeCount  = _FLD2VAL(CY_SMIF_SFDP_PAGE_PROG_COUNT, chipEraseProgTime);
            uint32_t progMul = _FLD2VAL(CY_SMIF_SFDP_PROG_MUL_COUNT, chipEraseProgTime);
            uint32_t progUs;

            if (CY_SMIF_SFDP_UNIT_0 == programTimeUnits)
            {
                progUs = CY_SMIF_SFDP_PROG_TIME_8US;
            }
            else
            {
                progUs = CY_SMIF_SFDP_PROG_TIME_64US;
            }
            /* Convert typical time to max time */
            device->programTime = ((programTimeCount + 1U) * progUs) * (2U * (progMul + 1U));


            /* The size of the external memory */
            uint32_t locSize = Cy_SMIF_PackBytesArray(&sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_04 +
                                                                    offset], true);

            if (0UL == (locSize & CY_SMIF_SFDP_SIZE_ABOVE_4GB_Msk))
            {
                device->memSize = (locSize + 1UL)/CY_SMIF_BITS_IN_BYTE;
            }
            else
            {
                device->memSize = (locSize - CY_SMIF_BITS_IN_BYTE_ABOVE_4GB) |
                        CY_SMIF_SFDP_SIZE_ABOVE_4GB_Msk;
            }

            /* The page size */
            device->programSize = 0x01UL << _FLD2VAL(CY_SMIF_SFDP_PAGE_SIZE,
                (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_28 + offset]);

            /* The size of the Erase sector */
            device->eraseSize = (0x01UL << (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_1C + offset]);

            /* This specifies the Read command. The preference order Quad>Dual>SPI */
            if ((_FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_4_4,
                                    ((uint32_t) sfdpBuffer[sfdpDataIndex])) == 1UL) &&
                                                (CY_SMIF_DATA_SEL1 != dataSelect) &&
                                                (CY_SMIF_DATA_SEL3 != dataSelect))
            {
                /* The 8-bit command. 4 x I/O Read command */
                cmdRead->command = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_09 + offset];

                /* The width of the command transfer */
                cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

                /* The width of the address transfer */
                cmdRead->addrWidth = CY_SMIF_WIDTH_QUAD;

                /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
                if ((_FLD2VAL(CY_SMIF_SFDP_1_4_4_MODE_CYCLES,
                    (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_08 + offset])) == 0U)
                {
                    cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
                }
                else
                {
                    cmdRead->mode = CY_SMIF_READ_MODE_BYTE;
                }

                /* The number of the dummy cycles. A zero value suggests no dummy cycles */
                cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_4_4_DUMMY_CYCLES, (uint32_t) sfdpBuffer
                                        [CY_SMIF_SFDP_BFPT_BYTE_08 + offset]);

                /* The width of the data transfer*/
                cmdRead->dataWidth = CY_SMIF_WIDTH_QUAD;
            }
            else
            {
                if ((_FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_1_4,
                                    ((uint32_t)sfdpBuffer[sfdpDataIndex])) == 1UL)  &&
                                                (CY_SMIF_DATA_SEL1 != dataSelect) &&
                                                (CY_SMIF_DATA_SEL3 != dataSelect))
                {
                    /* The 8-bit command. 4 x I/O Read command */
                    cmdRead->command  =
                            sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0B + offset];

                    /* The width of the command transfer */
                    cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

                    /* The width of the address transfer */
                    cmdRead->addrWidth = CY_SMIF_WIDTH_QUAD;

                    /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
                    if ((_FLD2VAL(CY_SMIF_SFDP_1_1_4_MODE_CYCLES, (uint32_t) sfdpBuffer
                                    [CY_SMIF_SFDP_BFPT_BYTE_0A + offset])) == 0U)
                    {
                        cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
                    }
                    else
                    {
                        cmdRead->mode = CY_SMIF_READ_MODE_BYTE;
                    }

                    /* The number of the dummy cycles. A zero value suggests no dummy cycles */
                    cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_1_4_DUMMY_CYCLES,
                        (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0A + offset]);

                    /* The width of the data transfer*/
                    cmdRead->dataWidth = CY_SMIF_WIDTH_QUAD;
                }
                else
                {
                    if ((_FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_2_2,
                                        (uint32_t)sfdpBuffer[sfdpDataIndex])) == 1UL)
                    {
                        /* The 8-bit command. 2 x I/O Read command */
                        cmdRead->command  = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0F + offset];

                        /* The width of the command transfer */
                        cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

                        /* The width of the address transfer */
                        cmdRead->addrWidth = CY_SMIF_WIDTH_DUAL;

