pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif_memslot.c
                        /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
                        if ((_FLD2VAL(CY_SMIF_SFDP_1_2_2_MODE_CYCLES, (uint32_t)
                            sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0E + offset])) == 0U)
                        {
                            cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
                        }
                        else
                        {
                            cmdRead->mode = CY_SMIF_READ_MODE_BYTE;
                        }

                        /* The number of the dummy cycles. A zero value suggests no dummy cycles */
                        cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_2_2_DUMMY_CYCLES,
                                                (uint32_t) sfdpBuffer [CY_SMIF_SFDP_BFPT_BYTE_0E + offset]);

                        /* The width of the data transfer*/
                        cmdRead->dataWidth = CY_SMIF_WIDTH_DUAL;
                    }
                    else
                    {
                        if ((_FLD2VAL(CY_SMIF_SFDP_FAST_READ_1_1_2,
                                            (uint32_t)sfdpBuffer[sfdpDataIndex])) == 1UL)
                        {
                            /* The 8-bit command. 2 x I/O Read command */
                            cmdRead->command  = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0D + offset];

                            /* The width of the command transfer */
                            cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

                            /* The width of the address transfer */
                            cmdRead->addrWidth = CY_SMIF_WIDTH_SINGLE;

                            /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
                            if ((_FLD2VAL(CY_SMIF_SFDP_1_1_2_MODE_CYCLES, (uint32_t)
                                sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0C + offset])) == 0U)
                            {
                                cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
                            }
                            else
                            {
                                cmdRead->mode = CY_SMIF_READ_MODE_BYTE;
                            }

                            /* The number of the dummy cycles. A zero value suggests no dummy cycles */
                            cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_1_2_DUMMY_CYCLES,
                                    (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_0C + offset]);

                            /* The width of the data transfer*/
                            cmdRead->dataWidth = CY_SMIF_WIDTH_DUAL;
                        }
                        else
                        {
                            /* The 8-bit command. 1 x I/O Read command */
                            cmdRead->command  = CY_SMIF_SINGLE_READ_CMD;

                            /* The width of the command transfer */
                            cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

                            /* The width of the address transfer */
                            cmdRead->addrWidth = CY_SMIF_WIDTH_SINGLE;

                            /* The 8 bit-mode byte. This value is 0xFFFFFFFF when there is no mode present */
                            cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;

                            /* The number of the dummy cycles. A zero value suggests no dummy cycles */
                            cmdRead->dummyCycles = 0U;

                            /* The width of the data transfer*/
                            cmdRead->dataWidth = CY_SMIF_WIDTH_SINGLE;
                        }
                    }
                }
            }

            /* The Write Enable command */
            /* The 8-bit command. Write Enable */
            device->writeEnCmd->command = CY_SMIF_WR_ENABLE_CMD;
            /* The width of the command transfer */
            device->writeEnCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

            /* The Write Disable command */
            /* The 8-bit command. Write Disable */
            device->writeDisCmd->command = CY_SMIF_WR_DISABLE_CMD;
            /* The width of the command transfer */
            device->writeDisCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

            /* The chip Erase command */
            /* The 8-bit command. Chip Erase */
            device->chipEraseCmd->command  = CY_SMIF_CHIP_ERASE_CMD;
            /* The width of the command transfer */
            device->chipEraseCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

            /* The sector Erase command */
            /* The 8-bit command. The sector Erase */
            device->eraseCmd->command  =
                        sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_1D + offset];
            /* The width of the command transfer */
            device->eraseCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;
            /* The width of the address transfer */
            device->eraseCmd->addrWidth = CY_SMIF_WIDTH_SINGLE;

            /* This specifies the program command */
            /* The 8-bit command. 1 x I/O Program command */
            device->programCmd->command = CY_SMIF_SINGLE_PROGRAM_CMD;
            /* The width of the command transfer */
            device->programCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;
            /* The width of the address transfer */
            device->programCmd->addrWidth = CY_SMIF_WIDTH_SINGLE;
            /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
            device->programCmd->mode = CY_SMIF_NO_COMMAND_OR_MODE;
            /* The number of the dummy cycles. A zero value suggests no dummy cycles */
            device->programCmd->dummyCycles = 0U;
            /* The width of the data transfer*/
            device->programCmd->dataWidth = CY_SMIF_WIDTH_SINGLE;

            /* The busy mask for the status registers */
            device->stsRegBusyMask = CY_SMIF_STS_REG_BUSY_MASK;

            /* The command to read the WIP-containing status register */
            /* The 8-bit command. WIP RDSR */
            device->readStsRegWipCmd->command  = CY_SMIF_RD_STS_REG1_CMD;
            /* The width of the command transfer */
            device->readStsRegWipCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

            /* The command to write into the QE-containing status register */
            /* The width of the command transfer */
            device->writeStsRegQeCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

            /* The QE mask for the status registers */
            switch (_FLD2VAL(CY_SMIF_SFDP_QE_REQUIREMENTS, (uint32_t)sfdpBuffer
                [CY_SMIF_SFDP_BFPT_BYTE_3A + offset]))
            {
                case CY_SMIF_SFDP_QER_0:
                    device->stsRegQuadEnableMask = CY_SMIF_NO_COMMAND_OR_MODE;
                    device->writeStsRegQeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                    device->readStsRegQeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                    break;
                case CY_SMIF_SFDP_QER_1:
                case CY_SMIF_SFDP_QER_4:
                case CY_SMIF_SFDP_QER_5:
                    device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_1_OF_SR_2;

                    /* The command to write into the QE-containing status register */
                    /* The 8-bit command. QE WRSR */
                    device->writeStsRegQeCmd->command  = CY_SMIF_WR_STS_REG1_CMD;
                    device->readStsRegQeCmd->command  = CY_SMIF_RD_STS_REG2_T1_CMD;
                    break;
                case CY_SMIF_SFDP_QER_2:
                    device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_6_OF_SR_1;

                    /* The command to write into the QE-containing status register */
                    /* The 8-bit command. QE WRSR */
                    device->writeStsRegQeCmd->command  = CY_SMIF_WR_STS_REG1_CMD;
                    device->readStsRegQeCmd->command  = CY_SMIF_RD_STS_REG1_CMD;
                    break;
                case CY_SMIF_SFDP_QER_3:
                    device->stsRegQuadEnableMask = CY_SMIF_SFDP_QE_BIT_7_OF_SR_2;

                    /* The command to write into the QE-containing status register */
                    /* The 8-bit command. QE WRSR */
                    device->writeStsRegQeCmd->command  = CY_SMIF_WR_STS_REG2_CMD;
                    device->readStsRegQeCmd->command  = CY_SMIF_RD_STS_REG2_T2_CMD;
                    break;
                default:
                    break;
            }
        }
        else
        {
            result = CY_SMIF_NO_SFDP_SUPPORT;
        }
    }

    return(result);
}

#if defined(__cplusplus)
}
#endif


/* [] END OF FILE */
